app/views/lists/show.html.erb

SELECT "local_items".* FROM "local_items" WHERE "local_items"."list_id" = ?  [["list_id", 5]]
---
<ul class="lista-usuario">
  <% @list.local_items.each do |item| %>