app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-06-07 06:53:36.932971"], ["updated_at", "2022-06-07 06:53:36.932971"]]