app/controllers/livros_controller.rb

SELECT "livros".* FROM "livros"
---
  def index
    @livros = Livro.all

INSERT INTO "livros" ("titulo", "autor", "ano", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "Memorias Póstumas de Brás Cubas"], ["autor", "Machado de Assis"], ["ano", 1990], ["created_at", "2022-06-06 04:12:14.028924"], ["updated_at", "2022-06-06 04:12:14.028924"]]
---
  def create
    @livro = Livro.new(livro_params)

    respond_to do |format|
      if @livro.save

UPDATE "livros" SET "titulo" = ?, "autor" = ?, "ano" = ?, "updated_at" = ? WHERE "livros"."id" = ?  [["titulo", "Dom Quixote de la Mancha"], ["autor", "Miguel de Cervantes"], ["ano", 1970], ["updated_at", "2022-06-06 19:49:17.799309"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @livro.update(livro_params)

SELECT "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_livro
      @livro = Livro.find(params[:id])