app/controllers/local_items_controller.rb

  def index
    @local_items = LocalItem.all
---
SELECT "local_items".* FROM "local_items"

  def create
    livro = Livro.find(params[:livro_id]) #alterado
    @local_item = @list.local_items.build(livro: livro) #alterado

    respond_to do |format|
      if @local_item.save
---
SELECT "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-06-06 04:23:52.864338"], ["updated_at", "2022-06-06 04:23:52.864338"]]
INSERT INTO "local_items" ("livro_id", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["livro_id", 1], ["list_id", 1], ["created_at", "2022-06-06 04:52:20.844858"], ["updated_at", "2022-06-06 04:52:20.844858"]]

  def destroy
    @local_item.destroy
---
DELETE FROM "local_items" WHERE "local_items"."id" = ?  [["id", 980190962]]

    def set_local_item
      @local_item = LocalItem.find(params[:id])
---
SELECT "local_items".* FROM "local_items" WHERE "local_items"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]