app/controllers/store_controller.rb

  def index
    @livros = Livro.order(:titulo).page params[:page]
---
SELECT "livros".* FROM "livros" ORDER BY "livros"."titulo" ASC LIMIT ? OFFSET ?  [["LIMIT", 50], ["OFFSET", 0]]
SELECT COUNT(*) FROM "livros"