app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Paulo Pettryck"], ["email", "paulomts@hotmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-06-09 03:19:05.343211"], ["updated_at", "2022-06-09 03:19:05.343211"]]
---
  def create
    @user = User.new(user_params)
    case
    when @user.save