app/controllers/concerns/current_list.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-06-08 15:44:02.982801"], ["updated_at", "2022-06-08 15:44:02.982801"]]
---
      def set_list
        @list = List.find(session[:list_id])
      rescue ActiveRecord::RecordNotFound
        @list = List.create